# Требующийся функционал программы:
# 1. Дополнить функционал программы с массивами.
# 2. Возможность создавать списки и массивы с одинаковыми входными данными.
# 3. Реализовать перестановку двух конкретных элементов в массиве и списке (по значению).
# 4. Реализовать все три типа списков (связный, двусвязный, двусторонний) в целях проверки скорости перехода к следующему (для всех 3 типов) предыдущему (для двусвязного) и к последнему элементу (для двусвязного и двустороннего списков).
# 5. Должна иметься возможность вставить/удалить/найти элемент. Поиск должен быть реализован как по индексу, так и по значению.
# 6. Реализация сортированного списка методом вставки.

