# Требующийся функционал программы:
# 1. Создать калькулятор, обрабатывающий несколько действий за раз. Базовые операции: сложение, вычитание, умножение, деление, возведение в степень
# 2. Полноценный интерфейс, позволяющий вводить числовые и символьные значения, обработка отрицательных значений, ошибка при вводе текста.
# 3. Учёт порядка действий на основе скобок.
# 4. Реализация Back-end расчётов на основе стека при помощи обратной польской записи.
# 5*. (Дополнительные баллы): реализовать экспоненту, логарифм.
# 6*. (Дополнительные баллы): реализовать обработку чисел e и π
# 7*. (Дополнительные баллы): реализовать вычисление тригонометрических функций.

